{
    "version" : "https://jsonfeed.org/version/1",
    "title" : "Insigth on AsseTTrakk -  Technology Solutions",
    "description": "Recent content in Insigth on AsseTTrakk -  Technology Solutions",
    "home_page_url" : "",
    "feed_url" : "/insigth.json",
    "icon" : "apple-touch-icon-180.png",
    "favicon" : "icon-64.png",
    "author" : {
        "name" : "John Rollins",
        "url": "https://assettrakk.com/index.html",
        "avatar": "path/to/some-image.jpg"
    },
    "items" : [
    {
        "title" : "5 Ways To Reduce IT Costs",
        "date_published" : "2018-10-08T12:37:10-04:00",
        "date_modified" : "2018-10-08T12:37:10-04:00",
        "id" : "/insigth/it-savings.html",
        "url" : "/insigth/it-savings.html",
        "author" : {
          "name" : "John Rollins"
        },
        "content_html" : "\n\n\u003ch2 id=\"5-ways-to-reduce-information-technology-costs\"\u003e5 Ways to reduce Information Technology Costs\u003c/h2\u003e\n\n\u003ch2 id=\"1-automate-wherever-possible\"\u003e1. Automate wherever possible\u003c/h2\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eIt is already known that automation can make a difference to overhead costs while increasing productivity of most of today\u0026rsquo;s businesses. There is a way to automate the routine tasks of almost all business function. Automation can be valuable in freeing resources that can be better used on the thing most important to the success of any business.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003ch2 id=\"2-move-it-infrastructure-to-the-cloud\"\u003e2. Move IT infrastructure to the cloud\u003c/h2\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eWhether you are small office or a large government office the software you use to manage you business require servers someplace. You will need the key applications that allow you to provide services to your customers running on servers. You also need to store all your business data securely in one place.  Historical information needs to be archived in a secure location as well. All of this requires capital expenditure for daily operations, maintenance and upgrades. Also this computing power consumption also shows up in your electricity bill.\nThe advent of cloud computing you can host most of the required applications off site and reduce operating cost while benefiting from higher reliability.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003ch2 id=\"3-switch-to-free-apps-and-tools\"\u003e3. Switch to free apps and tools\u003c/h2\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eIf you look carefully you can find a free version of every software package in your business today. By switching to free software you can significantly reduce your capital cost for information technology.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003ch2 id=\"4-invest-in-green-technologies\"\u003e4. Invest in green technologies\u003c/h2\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eGoing green can reduce expenditure for any business by as much as 70% of annual costs with investments in CFL and LED lights. Many of the services delivered by computers can also be hosted on small low power consuming computers as well that cost much less from the traditional PC.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003ch2 id=\"5-switch-to-linux\"\u003e5. Switch to Linux\u003c/h2\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eYou reduce cost by switching to Linux on your computers. Desktop applications on this operating system have a long way and are extremely reliable. Many of the devices that we use today are a flavor of Linux so it is not new to any f us. Linux application are reliable and run on most devices available today. Linux is largely a free OS that can run on a bare bones computer.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003e\u003cem\u003e\u003ca href=\"/contact.html\"\u003eYou are welcome to contact us today\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n"
    },
    {
        "title" : "Marine AIS",
        "date_published" : "2018-10-03T08:51:22-04:00",
        "date_modified" : "2018-10-03T08:51:22-04:00",
        "id" : "/insigth/ais.html",
        "url" : "/insigth/ais.html",
        "content_html" : "\n\n\u003ch2 id=\"what-is-marine-automatic-identification-system\"\u003eWhat is Marine Automatic Identification System.\u003c/h2\u003e\n\n\u003cp\u003eMarine Automatic Identification System (AIS) is a system that transmits tracking information of ships and used by vessel tracking services(VTS). When satellites are used to detect signals the term Satellite-AIS (S-AIS) is used to differentiate from signals received by terrestrial coastal watch stations. A ship\u0026rsquo;s AIS signature includes the unique identification code, position, course and speed as well as destination and estimated time of arrival displayed on a screen. Vessel equipped with AIS are tracked by coastline base-stations networks and by satellite when out of the range of the terrestrial networks.\u003c/p\u003e\n\n\u003cp\u003eIt is not a vessel monitoring utility or fishing catch monitoring system and it is dependent on its operator for the proper entry of information and for it to be turned on. Most not all vessels have AIS including fishing boats.\u003c/p\u003e\n\n\u003cp\u003eThis tracking technology was designed to be used between ships at sea in addition to radar to call out presence to other ships to avoid collisions.\u003c/p\u003e\n\n\u003ch3 id=\"regulations\"\u003eRegulations\u003c/h3\u003e\n\n\u003cp\u003eThe International Maritime Organization\u0026rsquo;s International Convention for the Safety of Life at Sea requires AIS to be fitted aboard international voyaging ships with 300 or more gross tonnage (GT), and all passenger ships regardless of size.\u003c/p\u003e\n\n\u003cp\u003eIn 2010 most commercial vessels operating on the European Inland Waterways were required to fit an Inland waterway certified Class A unit, all EU fishing boats over 15m were to have a Class A by May 2014, and the US had a long-pending extension to their existing AIS fit rules which was expected to come into force during 2013.\u003c/p\u003e\n\n\u003ch3 id=\"range\"\u003eRange\u003c/h3\u003e\n\n\u003cp\u003eShipboard AIS transceivers have a horizontal range that is highly variable, but typically only up to about 74 kilometres (46 mi). They reach much further vertically – up to the 400 km orbit of the International Space Station (ISS).\u003c/p\u003e\n\n\u003ch3 id=\"use-cases\"\u003eUse Cases\u003c/h3\u003e\n\n\u003cp\u003eNational Authorities use AIS for a number of monitoring activities along their coast lines. Depending on the coast base watch stations vessels can be monitored up to a range of 100Km (60mi) and supplementary data from satellite networks fill in for signals further away.\u003c/p\u003e\n\n\u003cp\u003eAIS is used for monitoring and control:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e1.Fishing fleet\u003c/p\u003e\n\n\u003cp\u003e2.Maritime security\u003c/p\u003e\n\n\u003cp\u003e3.Aids to navigation\u003c/p\u003e\n\n\u003cp\u003e4.Search and rescue\u003c/p\u003e\n\n\u003cp\u003e5.Accident investigation\u003c/p\u003e\n\n\u003cp\u003e6.Ocean currents estimates\u003c/p\u003e\n\n\u003cp\u003e7.Infrastructure Protection\u003c/p\u003e\n\n\u003cp\u003e8.Fleet and cargo tracking\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003ch3 id=\"rf-transmission\"\u003eRF Transmission\u003c/h3\u003e\n\n\u003cp\u003eAIS uses the globally allocated VHF Marine Band channels:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cblockquote\u003e\n\u003cp\u003eChannel A 161.975 MHz (87B)\nChannel B 162.025 MHz (88B)\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eMost AIS transmissions are composed of bursts of several messages. In these cases, between messages, the AIS transmitter must change channel.\nAIS messages are transmitted using GMSK modulation. The GMSK modulator BT-product used for transmission of data should be 0.4 maximum (highest nominal value).\u003c/p\u003e\n\n\u003cp\u003eThe GMSK coded data should frequency modulate the VHF transmitter. The modulation index should be 0.5.\u003c/p\u003e\n\n\u003cp\u003eThe transmission bit rate is 9600bit/s\nOrdinary VHF receivers can receive AIS with the filtering disabled. However, the audio output from the radio would need to be then decoded. Several software defined radio (SDR) computer applications can decode the AIS signal.\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003e\u003cem\u003e\u003ca href=\"/contact.html\"\u003eYou are welcome to contact us today\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n"
    },
    {
        "title" : "Boat Logbook",
        "date_published" : "2018-10-02T10:38:22-04:00",
        "date_modified" : "2018-10-02T10:38:22-04:00",
        "id" : "/insigth/boatlogsbooks.html",
        "url" : "/insigth/boatlogsbooks.html",
        "content_html" : "\n\n\u003ch2 id=\"electronic-logbook-benefits\"\u003eElectronic Logbook Benefits\u003c/h2\u003e\n\n\u003cp\u003eThe benefits of a digital logbook on a boat:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eLower fuel costs\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eLower maintenance costs\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eIncrease reliability\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eBetter security of your assets\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eComputers can be used to automate many routine tasks on a boat.\u003c/p\u003e\n\n\u003ch2 id=\"electronic-logbook-setup-checklist\"\u003eElectronic Logbook Setup Checklist:\u003c/h2\u003e\n\n\u003cp\u003eWhat you will need:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003ePower Efficient Computer\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003e12VDC Computer\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eSoftware\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eSensors\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eGPS receiver\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eNavigation Charts\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVHF antenna\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eCabling\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eCameras\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eOptional Cell phone Data Plan\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003e\u003cem\u003e\u003ca href=\"/contact.html\"\u003eYou are welcome to contact us today\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n"
    },
    {
        "title" : "Transmitter Sites Tower Inspections",
        "date_published" : "2018-10-02T10:17:20-04:00",
        "date_modified" : "2018-10-02T10:17:20-04:00",
        "id" : "/insigth/transmittersites.html",
        "url" : "/insigth/transmittersites.html",
        "content_html" : "\n\n\u003ch3 id=\"tower-inspections-check-list\"\u003eTower Inspections Check List:\u003c/h3\u003e\n\n\u003cp\u003ePreventative maintenance at FM Broadcast transmission sites must include appropriate risk\nmanagement practices.\u003c/p\u003e\n\n\u003cp\u003eTherefore it is highly recommended that a structural and equipment\ninspection be done annually and after any severe weather to ensure continued high availability\nof the Broadcast Services.\u003c/p\u003e\n\n\u003cp\u003eThe following is what is included in the standard transmitter site\ninspection for towers.\u003c/p\u003e\n\n\u003cp\u003ePhotos will be taken of key details and will be kept for future use to\ntrack changes over time that might require attention for risk mitigation.\u003c/p\u003e\n\n\u003ch4 id=\"schedule\"\u003eSchedule:\u003c/h4\u003e\n\n\u003cp\u003eAnnual Inspections\nSevere Weather and Natural Disasters. Following significant weather and disaster events.\u003c/p\u003e\n\n\u003ch4 id=\"self-supporting-tower-inspection\"\u003eSelf Supporting Tower Inspection:\u003c/h4\u003e\n\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eVisual inspection of overall condition of the tower from ground\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eMeasurement of base flange heights to verify that tower is plumb\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVisual inspection of Civil Aviation lighting for proper function\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVerify operation of photo cell switch\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVisual inspection of safety climb if applicable\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVisual inspection of overall tower condition noting any potential problems\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVisual inspection of antennas and transmission lines\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVisual inspection of paint condition if applicable\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eEquipment environment operating temperature\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003ch4 id=\"equipment-shelter-inspection\"\u003eEquipment Shelter inspection:\u003c/h4\u003e\n\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eVisual inspection of equipment connections\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVisual inspection of RF equipment performance compliance\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eIdentify equipment and performance changes\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eIdentify Equipment operating condition\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eSystem grounding inspection\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eBackup power system condition inspection\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eEquipment environment operating temperature\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eVisual inspection of overall site condition\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003ch4 id=\"other-included-inspection-items\"\u003eOther Included Inspection Items:\u003c/h4\u003e\n\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eBroadcast Antenna Inspections\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eBroadcast Line Pressure Checks\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eModulation performance confirmation\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eCheck Radio Frequency Interference Status\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003e\u003cem\u003e\u003ca href=\"/contact.html\"\u003eYou are welcome to contact us today\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n"
    },
    {
        "title" : "Video Quality",
        "date_published" : "2018-10-01T21:06:43-04:00",
        "date_modified" : "2018-10-01T21:06:43-04:00",
        "id" : "/insigth/videoquality.html",
        "url" : "/insigth/videoquality.html",
        "author" : {
          "name" : "John Rollins"
        },
        "content_html" : "\n\n\u003ch3 id=\"why-video-streams-have-higher-quality-than-a-broadcast-tv-station-feed\"\u003eWhy video streams have higher quality than a Broadcast TV station feed.\u003c/h3\u003e\n\n\u003cp\u003eWe have become accustomed to seeing high quality video on most devices available today. There is an obvious difference between the pictures seen on a TV receiving terrestrial analogue transmissions from local TV stations such as CBC TV n Barbados and the quality of pictures streamed online or available from cable TV. Here we will outline the difference between TV station transmission of video and that available from streaming sources and cable TV.\u003c/p\u003e\n\n\u003ch4 id=\"streaming-video\"\u003eStreaming Video\u003c/h4\u003e\n\n\u003cp\u003eIn many cases video streams are distributed online from sources that are connected directly to a video encoder that delvers the video directly to the end user.  A video encoder is the stage where the signal from the video source is converted to an Internet protocol (IP) signal that can be distributed over the Internet. Video cameras especially professional one output quality and often high resolution signals. As a result encoding a video signal directly from a video source routinely results in very high quality pictures. Streaming video has the following characteristics:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eThe video source connects directly to a video encoder that encapsulate the video into an I stream.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eThe video encoder is connected directly to a online distribution server.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eOnline viewers connect directly to the online distribution server to receive the stream.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eViewers receive the IP stream that contains the encoded high resolution video feed.\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eThe encoding and distribution of the video signal results in very little degrading of the video quality because the video signal once converted into a I signal is not directly subject to much processing on the way to the end user because it is the containing IP signal that receive much of the processing on it way to the user.\u003c/p\u003e\n\n\u003ch4 id=\"tv-station-video\"\u003eTV Station Video\u003c/h4\u003e\n\n\u003cp\u003eTraditional TV stations in the Caribbean such as CBC TV8 Barbados operate using the National Television Standard Committee (NTSC) system for production and distribution of video signals. In the NTSC system the analogue signal produced at the camera is sent through a number of stages that each contribute some level of degrading of the signal quality on the way to the end user.\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eTV station video sources such as those from a remote broadcast or outside broadcast are produced using high quality equipment.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eThis video source is sent to the station via a NTSC link that has an impact on quality.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eThis signal has to be synchronized with other NTSC sources in the TV station that also contribution a level of degrading of the signal.\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eThe Studio output is sent by a link to the analogue NTSC transmitter (the distribution point).\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eViewers receive the degraded analogue NTSC resolution feed from the transmitter.\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eIf it was possible to view the signal produced at the camera side by side with the signal received form the transmitter an observer wuld easily see the difference in quality of the two signals.\u003c/p\u003e\n\n\u003ch4 id=\"resolutions\"\u003eRESOLUTIONS\u003c/h4\u003e\n\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cp\u003eStreaming - Streaming Video Resolution is usually 1280x720\u003c/p\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003cp\u003eBroadcast TV - Analogue NTSC Resolution is 440 x 486\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eSolution for Broadcast TV: Migrate Remote Broadcasts to High Definition Contribution Quality!\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003e\u003cem\u003e\u003ca href=\"/contact.html\"\u003eYou are welcome to contact us today\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n"
    },
    {
        "title" : "Why Radio Websites Fail",
        "date_published" : "2018-10-01T20:59:22-04:00",
        "date_modified" : "2018-10-01T20:59:22-04:00",
        "id" : "/insigth/media.html",
        "url" : "/insigth/media.html",
        "content_html" : "\n\n\u003ch3 id=\"radio-and-tv-stations-websites-are-useless\"\u003eRadio and TV stations websites are useless.\u003c/h3\u003e\n\n\u003cp\u003eMost radio or TV stations websites in the Caribbean region are usually an attempt at on-line promotions of their programming.\u003c/p\u003e\n\n\u003cp\u003eThese websites will usually provide limited information regarding on-air talent, news and on-air promotions. The news stories on these websites are mostly not updated so as a result you are being encouraged to go to the local news paper website for the most up-to-date local news. Generally not even the regular station audience spend long periods on the websites and advertisers do not take them seriously. This is supported by the increasing amount of local businesses that are placing ads on-line through Google and Facebook. The question is can local stations make any money from websites given the advertising trends in 2018 and beyond?\u003c/p\u003e\n\n\u003cp\u003eThe following should be given attentions for improving traffic and sales to station websites:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003ch4 id=\"1-your-content-is-not-fresh\"\u003e1.Your content is not fresh.\u003c/h4\u003e\n\n\u003cp\u003eA lack of fresh content will affect search engine racking and impact on the number of visitors to your site. Visitors will return if your site is relevant and this includes having the up-to-date content expected by users. Also if you are providing news on your website your direct competitor is the newspaper so you have to be better at providing fresh content.\u003c/p\u003e\n\n\u003ch4 id=\"2-your-website-does-not-perform-well\"\u003e2.Your website does not perform well.\u003c/h4\u003e\n\n\u003cp\u003eVisitors to your website have become accustomed to websites that load quickly and are attractive so they have developed high expectations for what they are willing to accept.\u003c/p\u003e\n\n\u003cp\u003eYour website must load quickly.\u003c/p\u003e\n\n\u003cp\u003eVisitors must be able to find what they want easily.\u003c/p\u003e\n\n\u003cp\u003eVisitors should be able to read the content on any device.\u003c/p\u003e\n\n\u003cp\u003eYour site must be attractive in the opinion of the visitor.\u003c/p\u003e\n\n\u003ch4 id=\"3-you-re-not-promoting-your-site\"\u003e3.You\u0026rsquo;re not promoting your site.\u003c/h4\u003e\n\n\u003cp\u003eYou should be hammering the benefits of your website and providing reasons for visitors to come to the site regularly. This includes running promotions that tease visitors to come and do things on the website.\u003c/p\u003e\n\n\u003ch4 id=\"4-you-re-not-tracking-the-effectiveness-of-your-website\"\u003e4.You\u0026rsquo;re not tracking the effectiveness of your website.\u003c/h4\u003e\n\n\u003cp\u003eOver time if you are monitoring the results of changes on the website you to should become aware of what works and what does not work and be better able to target content that brings more traffic. There should be changes in content, visitor engagement and site promotions that provide traffic data that you can use to evaluate the effectiveness of the website. Such data collected should also be used to show advertisers the benefits of using your website.\u003c/p\u003e\n\n\u003ch4 id=\"5-your-sales-people-are-not-trained-to-sell-the-website\"\u003e5.Your sales people are not trained to sell the website.\u003c/h4\u003e\n\n\u003cp\u003eThe persons in your sales team may have grown you listening to your on-air work and maybe motivated and knowledgeable about the on-air content and talent.\u003c/p\u003e\n\n\u003cp\u003eAs a result they maybe more inclined to sell on-air advertising with more passion. It is critical that you show them the importance of the digital media services that you provide.\u003c/p\u003e\n\n\u003cp\u003eThey should be able to sell to advertisers that there is more than just banner ads. You can provide opportunities for guest posts, giveaways, sponsored features, articles and videos for example. Such initiatives will capture the attention of visitors and drive them to make purchases that increase your customer revenues.\u003c/p\u003e\n\n\u003ch4 id=\"6-you-have-too-many-links-away-from-your-website\"\u003e6.You have too many links away from your website.\u003c/h4\u003e\n\n\u003cp\u003eYou have to ask yourself if the links away from your site really add value to the website and the advertisers that use it.\u003c/p\u003e\n\n\u003ch4 id=\"7-your-site-is-not-mobile-friendly\"\u003e7.Your site is not mobile friendly.\u003c/h4\u003e\n\n\u003cp\u003eMore people are using mobile devices to access content on-line therefore your website must load quickly and be attractive to your visitors on any device they choice to use.\u003c/p\u003e\n\n\u003ch4 id=\"8-you-re-not-operating-your-website-as-another-channel\"\u003e8.You\u0026rsquo;re not operating your website as another channel.\u003c/h4\u003e\n\n\u003cp\u003eUltimately having more website visitors and more advertisers depends on how involved the station management team is with this asset. The station website should be consider an integral part of the station revenue earning assets.\u003c/p\u003e\n\n\u003cp\u003eYou have to ask yourself if you are investing the effort, time and resources into your website just as if it was another channel with a revenue stream to making it a success. You should regularly evaluate the website operations to determine if it is delivering the required targets.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003eGet a free website audit now.\n\u003cem\u003e\u003ca href=\"/contact.html\"\u003eYou are welcome to contact us today\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n"
    }
    ]
}
